#include "iic.h"
#include "intrins.h"
/**********************************************
//IIC Start
**********************************************/
/*******************************************************************************
* 函 数 名         : IIC_Start()
* 函数功能		   : IIC停止函数
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/
void IIC_Start()
{
	SCL = 1;		
	SDA = 1;
	_nop_();
	SDA = 0;
	_nop_();
	SCL = 0;
}

/**********************************************
//IIC Stop
**********************************************/
/*******************************************************************************
* 函 数 名         : IIC_Stop()
* 函数功能		   : IIC停止函数
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/
void IIC_Stop()
{
	SCL = 0;
	SDA = 0;
	_nop_();
	SCL = 1;
	SDA = 1;
	_nop_();
}
/*******************************************************************************
* 函 数 名         : Write_IIC_Byte(unsigned char IIC_Byte)
* 函数功能		   : IIC写入字节函数
* 输    入         : IIC_Byte
* 输    出         : 无
*******************************************************************************/
void Write_IIC_Byte(unsigned char IIC_Byte)
{
	unsigned char i;
	for(i=0;i<8;i++)		
	{
		if(IIC_Byte & 0x80)
			SDA=1;
		else
			SDA=0;
		SCL=1;
		_nop_();
		SCL=0;
		_nop_();
		IIC_Byte<<=1;
		_nop_();
	}
	SDA=1;
	SCL=1;
	_nop_();
	SCL=0;
	_nop_();
}
/*******************************************************************************
* 函 数 名         : Write_IIC_Command(unsigned char IIC_Command)
* 函数功能		   : IIC写命令函数
* 输    入         : IIC_Command
* 输    出         : 无
*******************************************************************************/
void Write_IIC_Command(unsigned char IIC_Command)
{
   IIC_Start();
   Write_IIC_Byte(0x78);            //从属地址,SA0=0
   Write_IIC_Byte(0x00);			//写入命令
   Write_IIC_Byte(IIC_Command); 
   IIC_Stop();
}
/*******************************************************************************
* 函 数 名         : Write_IIC_Data(unsigned char IIC_Data)
* 函数功能		   : IIC写数据函数
* 输    入         : IIC_Data
* 输    出         : 无
*******************************************************************************/
void Write_IIC_Data(unsigned char IIC_Data)
{
   IIC_Start();
   Write_IIC_Byte(0x78);			
   Write_IIC_Byte(0x40);			//写入数据
   Write_IIC_Byte(IIC_Data);
   IIC_Stop();
}

